node {
  name: "npr_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "ds_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "fLMask_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "fLInvMask_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "gtN_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "gtD_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "gtField_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 4
        }
      }
    }
  }
}
node {
  name: "clIMask_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "shapeMask_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "dsMask_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "2dMask_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "sLMask_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "curvMag_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "SASFieldNet/concat_field_input/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "SASFieldNet/concat_field_input"
  op: "ConcatV2"
  input: "npr_input"
  input: "2dMask_input"
  input: "ds_input"
  input: "fLMask_input"
  input: "sLMask_input"
  input: "curvMag_input"
  input: "SASFieldNet/concat_field_input/axis"
  attr {
    key: "N"
    value {
      i: 6
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "SASFieldNet/reg_f_input"
  op: "Identity"
  input: "SASFieldNet/concat_field_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\006\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "SASFieldNet/f_conv1/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "SASFieldNet/f_conv1/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "SASFieldNet/f_conv1/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv1/weights"
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/weights/Initializer/truncated_normal"
  op: "AddV2"
  input: "SASFieldNet/f_conv1/weights/Initializer/truncated_normal/mul"
  input: "SASFieldNet/f_conv1/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv1/weights"
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/weights"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv1/weights"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 6
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "SASFieldNet/f_conv1/weights"
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/weights/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "SASFieldNet/f_conv1/weights"
}
node {
  name: "SASFieldNet/f_conv1/weights/Assign"
  op: "AssignVariableOp"
  input: "SASFieldNet/f_conv1/weights"
  input: "SASFieldNet/f_conv1/weights/Initializer/truncated_normal"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/weights/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv1/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/kernel/Regularizer/Square/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv1/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/kernel/Regularizer/Square"
  op: "Square"
  input: "SASFieldNet/f_conv1/kernel/Regularizer/Square/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/kernel/Regularizer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/kernel/Regularizer/Sum"
  op: "Sum"
  input: "SASFieldNet/f_conv1/kernel/Regularizer/Square"
  input: "SASFieldNet/f_conv1/kernel/Regularizer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/kernel/Regularizer/mul/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0002500000118743628
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/kernel/Regularizer/mul"
  op: "Mul"
  input: "SASFieldNet/f_conv1/kernel/Regularizer/mul/x"
  input: "SASFieldNet/f_conv1/kernel/Regularizer/Sum"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv1/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/Conv2D"
  op: "Conv2D"
  input: "SASFieldNet/reg_f_input"
  input: "SASFieldNet/f_conv1/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv1/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv1/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "SASFieldNet/f_conv1/BatchNorm/beta"
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "SASFieldNet/f_conv1/BatchNorm/beta"
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/beta/Assign"
  op: "AssignVariableOp"
  input: "SASFieldNet/f_conv1/BatchNorm/beta"
  input: "SASFieldNet/f_conv1/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv1/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv1/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/moving_mean"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv1/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "SASFieldNet/f_conv1/BatchNorm/moving_mean"
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/moving_mean/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "SASFieldNet/f_conv1/BatchNorm/moving_mean"
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/moving_mean/Assign"
  op: "AssignVariableOp"
  input: "SASFieldNet/f_conv1/BatchNorm/moving_mean"
  input: "SASFieldNet/f_conv1/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/moving_mean/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv1/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv1/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/moving_variance"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv1/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "SASFieldNet/f_conv1/BatchNorm/moving_variance"
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/moving_variance/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "SASFieldNet/f_conv1/BatchNorm/moving_variance"
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/moving_variance/Assign"
  op: "AssignVariableOp"
  input: "SASFieldNet/f_conv1/BatchNorm/moving_variance"
  input: "SASFieldNet/f_conv1/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/moving_variance/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv1/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv1/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv1/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv1/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "SASFieldNet/f_conv1/Conv2D"
  input: "SASFieldNet/f_conv1/BatchNorm/Const"
  input: "SASFieldNet/f_conv1/BatchNorm/ReadVariableOp"
  input: "SASFieldNet/f_conv1/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "SASFieldNet/f_conv1/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "SASFieldNet/f_conv1/Relu"
  op: "Relu"
  input: "SASFieldNet/f_conv1/BatchNorm/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000 \000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "SASFieldNet/f_conv2/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv2/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "SASFieldNet/f_conv2/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "SASFieldNet/f_conv2/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv2/weights"
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/weights/Initializer/truncated_normal"
  op: "AddV2"
  input: "SASFieldNet/f_conv2/weights/Initializer/truncated_normal/mul"
  input: "SASFieldNet/f_conv2/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv2/weights"
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/weights"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv2/weights"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "SASFieldNet/f_conv2/weights"
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/weights/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "SASFieldNet/f_conv2/weights"
}
node {
  name: "SASFieldNet/f_conv2/weights/Assign"
  op: "AssignVariableOp"
  input: "SASFieldNet/f_conv2/weights"
  input: "SASFieldNet/f_conv2/weights/Initializer/truncated_normal"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/weights/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv2/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/kernel/Regularizer/Square/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv2/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/kernel/Regularizer/Square"
  op: "Square"
  input: "SASFieldNet/f_conv2/kernel/Regularizer/Square/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/kernel/Regularizer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/kernel/Regularizer/Sum"
  op: "Sum"
  input: "SASFieldNet/f_conv2/kernel/Regularizer/Square"
  input: "SASFieldNet/f_conv2/kernel/Regularizer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/kernel/Regularizer/mul/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0002500000118743628
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/kernel/Regularizer/mul"
  op: "Mul"
  input: "SASFieldNet/f_conv2/kernel/Regularizer/mul/x"
  input: "SASFieldNet/f_conv2/kernel/Regularizer/Sum"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv2/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/Conv2D"
  op: "Conv2D"
  input: "SASFieldNet/f_conv1/Relu"
  input: "SASFieldNet/f_conv2/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv2/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv2/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "SASFieldNet/f_conv2/BatchNorm/beta"
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "SASFieldNet/f_conv2/BatchNorm/beta"
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/beta/Assign"
  op: "AssignVariableOp"
  input: "SASFieldNet/f_conv2/BatchNorm/beta"
  input: "SASFieldNet/f_conv2/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv2/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv2/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/moving_mean"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv2/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "SASFieldNet/f_conv2/BatchNorm/moving_mean"
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/moving_mean/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "SASFieldNet/f_conv2/BatchNorm/moving_mean"
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/moving_mean/Assign"
  op: "AssignVariableOp"
  input: "SASFieldNet/f_conv2/BatchNorm/moving_mean"
  input: "SASFieldNet/f_conv2/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/moving_mean/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv2/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv2/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/moving_variance"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv2/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "SASFieldNet/f_conv2/BatchNorm/moving_variance"
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/moving_variance/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "SASFieldNet/f_conv2/BatchNorm/moving_variance"
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/moving_variance/Assign"
  op: "AssignVariableOp"
  input: "SASFieldNet/f_conv2/BatchNorm/moving_variance"
  input: "SASFieldNet/f_conv2/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/moving_variance/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv2/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv2/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv2/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv2/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "SASFieldNet/f_conv2/Conv2D"
  input: "SASFieldNet/f_conv2/BatchNorm/Const"
  input: "SASFieldNet/f_conv2/BatchNorm/ReadVariableOp"
  input: "SASFieldNet/f_conv2/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "SASFieldNet/f_conv2/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "SASFieldNet/f_conv2/Relu"
  op: "Relu"
  input: "SASFieldNet/f_conv2/BatchNorm/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_pool1/MaxPool"
  op: "MaxPool"
  input: "SASFieldNet/f_conv2/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv3/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000 \000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv3/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv3/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "SASFieldNet/f_conv3/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv3/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "SASFieldNet/f_conv3/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "SASFieldNet/f_conv3/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv3/weights"
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/weights/Initializer/truncated_normal"
  op: "AddV2"
  input: "SASFieldNet/f_conv3/weights/Initializer/truncated_normal/mul"
  input: "SASFieldNet/f_conv3/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv3/weights"
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/weights"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv3/weights"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "SASFieldNet/f_conv3/weights"
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/weights/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "SASFieldNet/f_conv3/weights"
}
node {
  name: "SASFieldNet/f_conv3/weights/Assign"
  op: "AssignVariableOp"
  input: "SASFieldNet/f_conv3/weights"
  input: "SASFieldNet/f_conv3/weights/Initializer/truncated_normal"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/weights/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv3/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/kernel/Regularizer/Square/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv3/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/kernel/Regularizer/Square"
  op: "Square"
  input: "SASFieldNet/f_conv3/kernel/Regularizer/Square/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/kernel/Regularizer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/kernel/Regularizer/Sum"
  op: "Sum"
  input: "SASFieldNet/f_conv3/kernel/Regularizer/Square"
  input: "SASFieldNet/f_conv3/kernel/Regularizer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/kernel/Regularizer/mul/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0002500000118743628
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/kernel/Regularizer/mul"
  op: "Mul"
  input: "SASFieldNet/f_conv3/kernel/Regularizer/mul/x"
  input: "SASFieldNet/f_conv3/kernel/Regularizer/Sum"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv3/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/Conv2D"
  op: "Conv2D"
  input: "SASFieldNet/f_pool1/MaxPool"
  input: "SASFieldNet/f_conv3/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv3/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv3/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "SASFieldNet/f_conv3/BatchNorm/beta"
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "SASFieldNet/f_conv3/BatchNorm/beta"
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/beta/Assign"
  op: "AssignVariableOp"
  input: "SASFieldNet/f_conv3/BatchNorm/beta"
  input: "SASFieldNet/f_conv3/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv3/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv3/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/moving_mean"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv3/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "SASFieldNet/f_conv3/BatchNorm/moving_mean"
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/moving_mean/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "SASFieldNet/f_conv3/BatchNorm/moving_mean"
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/moving_mean/Assign"
  op: "AssignVariableOp"
  input: "SASFieldNet/f_conv3/BatchNorm/moving_mean"
  input: "SASFieldNet/f_conv3/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/moving_mean/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv3/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv3/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/moving_variance"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv3/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "SASFieldNet/f_conv3/BatchNorm/moving_variance"
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/moving_variance/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "SASFieldNet/f_conv3/BatchNorm/moving_variance"
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/moving_variance/Assign"
  op: "AssignVariableOp"
  input: "SASFieldNet/f_conv3/BatchNorm/moving_variance"
  input: "SASFieldNet/f_conv3/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/moving_variance/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv3/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv3/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv3/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "SASFieldNet/f_conv3/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "SASFieldNet/f_conv3/Conv2D"
  input: "SASFieldNet/f_conv3/BatchNorm/Const"
  input: "SASFieldNet/f_conv3/BatchNorm/ReadVariableOp"
  input: "SASFieldNet/f_conv3/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "SASFieldNet/f_conv3/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "SASFieldNet/f_conv3/Relu"
  op: "Relu"
  input: "SASFieldNet/f_conv3/BatchNorm/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "SASFieldNet/f_conv4/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv4/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000@\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "SASFieldNet/f_conv4/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@SASFieldNet/f_conv4/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
